samples/ITI-44_request.xml

 <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
   <Action xmlns="http://www.w3.org/2005/08/addressing">urn:hl7-org:v3:PRPA_IN201301UV02</Action>
   <MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:7a180388-6ba7-4cbc-bffe-dfcdc4e602b7</MessageID>
   <To xmlns="http://www.w3.org/2005/08/addressing">http://epd-core.int.adswissnet.healthcare/mpi/pixmanager</To>
   <ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
    <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
   </ReplyTo>
  </soap:Header>
  <soap:Body>
   <PRPA_IN201301UV02 xmlns="urn:hl7-org:v3" ITSVersion="XML_1.0">
    <id root="647aee99-56e7-46f5-ac26-bb691834204a"/>
    <creationTime value="20200923113348"/>
    <interactionId root="2.16.840.1.113883.1.6" extension="PRPA_IN201301UV02"/>
    <processingCode code="P"/>
    <processingModeCode code="T"/>
    <acceptAckCode code="AL"/>
    <receiver typeCode="RCV">
     <device classCode="DEV" determinerCode="INSTANCE">
      <id root="1.3.6.1.4.1.21367.2017.2.4.98"/>
     </device>
    </receiver>
    <sender typeCode="SND">
     <device classCode="DEV" determinerCode="INSTANCE">
      <id root="1.3.6.1.4.1.21367.2017.2.2.100"/>
     </device>
    </sender>
    <controlActProcess classCode="CACT" moodCode="EVN">
     <code code="PRPA_TE201301UV02" codeSystem="2.16.840.1.113883.1.18"/>
     <subject typeCode="SUBJ" contextConductionInd="false">
      <registrationEvent classCode="REG" moodCode="EVN">
       <id nullFlavor="NA"/>
       <statusCode code="active"/>
       <subject1 typeCode="SBJ">
        <patient classCode="PAT">
         <id root="1.3.6.1.4.1.21367.2017.2.5.75" extension="T944"/>
         <statusCode code="active"/>
         <patientPerson classCode="PSN" determinerCode="INSTANCE">
          <name>
           <given>OVIE</given>
           <family qualifier="">BERGAN</family>
          </name>
          <administrativeGenderCode code="1" codeSystem="2.16.840.1.113883.5.1"/>
          <birthTime value="20020329"/>
          <addr>
           <streetAddressLine>KONIZBERGSTRASSE</streetAddressLine>
           <city>Bern</city>
           <postalCode>3018</postalCode>
          </addr>
          <asOtherIDs classCode="ACCESS">
           <id root="2.16.756.5.30.1.127.3.10.3" extension="761338420435200768"/>
           <scopingOrganization classCode="ORG" determinerCode="INSTANCE">
            <id root="2.16.756.5.30.1.127.3.10.3"/>
           </scopingOrganization>
          </asOtherIDs>
         </patientPerson>
         <providerOrganization classCode="ORG" determinerCode="INSTANCE">
          <id root="1.3.6.1.4.1.21367.2017.2.5.75"/>
          <name>Cistec COM Spital</name>
          <contactParty classCode="CON">
           <telecom value="mailto:myHospital@test.ch"/>
          </contactParty>
         </providerOrganization>
        </patient>
       </subject1>
       <custodian typeCode="CST">
        <assignedEntity classCode="ASSIGNED">
         <id root="1.3.6.1.4.1.21367.2017.2.5.75"/>
         <assignedOrganization classCode="ORG" determinerCode="INSTANCE">
          <name>Cistec COM Spital</name>
         </assignedOrganization>
        </assignedEntity>
       </custodian>
      </registrationEvent>
     </subject>
    </controlActProcess>
   </PRPA_IN201301UV02>
  </soap:Body>
</soap:Envelope>
