storage/xml/PatientRegistryAdd.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Header>
        <a:Action s:mustUnderstand="1">urn:hl7-org:v3:PRPA_IN201301UV02</a:Action>
        <a:MessageID>urn:uuid:f011adc6-7e53-4208-a963-9c224275ca37</a:MessageID>
        <a:ReplyTo>
            <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
        </a:ReplyTo>
        <a:To s:mustUnderstand="1">http://localhost:8083/PixService.svc</a:To>
    </s:Header>
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <PRPA_IN201301UV02 ITSVersion="XML_1.0" xmlns="urn:hl7-org:v3">
            <id root="96a59eca-9f25-4a75-a69b-483aabaa0636"/>
            <creationTime value="20211122100503"/>
            <interactionId root="2.16.840.1.113883.1.6" extension="PRPA_IN201301UV02"/>
            <processingCode code="P"/>
            <processingModeCode code="T"/>
            <acceptAckCode code="AL"/>
            <receiver typeCode="RCV">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="1.2.840.114350.1.13.99999.4567"/>
                </device>
            </receiver>
            <sender typeCode="SND">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="1.2.840.114350.1.13.99999.4568"/>
                </device>
            </sender>
            <controlActProcess classCode="CACT" moodCode="EVN">
                <subject typeCode="SUBJ">
                    <registrationEvent classCode="REG" moodCode="EVN">
                        <id nullFlavor="NA"/>
                        <statusCode code="active"/>
                        <subject1 typeCode="SBJ">
                            <patient classCode="PAT">
                                <id root="1.2.860.330100.01.14" extension="b0687c478e4a4881b29a297bc11fa894"/>
                                <statusCode code="active"/>
                                <patientPerson classCode="PSN" determinerCode="INSTANCE">
                                    <name>
                                        <given>杨发红</given>
                                        <family>YangFaHong</family>
                                    </name>
                                    <telecom value="13952342829" use="HP"/>
                                    <administrativeGenderCode code="F"/>
                                    <birthTime value="19680718"/>
                                    <addr>
                                        <streetAddressLine/>
                                    </addr>
                                    <asOtherIDs classCode="PAT">
                                        <id root="2.16.840.1.113883.4.1" extension="320831196807182424"/>
                                        <scopingOrganization classCode="ORG" determinerCode="INSTANCE">
                                            <id root="2.16.840.1.113883.4.1"/>
                                        </scopingOrganization>
                                    </asOtherIDs>
                                    <birthPlace xsi:nil="true"/>
                                </patientPerson>
                                <providerOrganization classCode="ORG" determinerCode="INSTANCE">
                                    <id root="21916626N33010317A1002"/>
                                    <name>树兰（杭州）医院</name>
                                    <contactParty classCode="CON">
                                        <telecom value=""/>
                                    </contactParty>
                                </providerOrganization>
                            </patient>
                        </subject1>
                        <custodian xsi:nil="true"/>
                    </registrationEvent>
                </subject>
            </controlActProcess>
        </PRPA_IN201301UV02>
    </s:Body>
</s:Envelope>
